In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as pls

In [2]:
# Importing the salary file
salaries = pd.read_csv("../Files/Univariate Statistics/Salaries.csv")
salaries.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [5]:
# Renaming the "Unnamed column"
salaries.rename(columns={'Unnamed: 0' : 'ID'}, inplace=True)
salaries.head()

   ID      rank discipline  yrs.since.phd  yrs.service   sex  salary
0   1      Prof          B             19           18  Male  139750
1   2      Prof          B             20           16  Male  173200
2   3  AsstProf          B              4            3  Male   79750
3   4      Prof          B             45           39  Male  115000
4   5      Prof          B             40           41  Male  141500

In [7]:
salaries.tail()

      ID      rank discipline  yrs.since.phd  yrs.service   sex  salary
392  393      Prof          A             33           30  Male  103106
393  394      Prof          A             31           19  Male  150564
394  395      Prof          A             42           25  Male  101738
395  396      Prof          A             25           15  Male   95329
396  397  AsstProf          A              8            4  Male   81035

In [8]:
salaries = salaries.set_index("ID")
salaries.head()

        rank discipline  yrs.since.phd  yrs.service   sex  salary
ID
1       Prof          B             19           18  Male  139750
2       Prof          B             20           16  Male  173200
3   AsstProf          B              4            3  Male   79750
4       Prof          B             45           39  Male  115000
5       Prof          B             40           41  Male  141500

## Numerical method

In this section, we shall examine some of the numerical summary measures for summarising and describing univariate data.

In [9]:
salaries.describe()

       yrs.since.phd  yrs.service         salary
count     397.000000   397.000000     397.000000
mean       22.314861    17.614610  113706.458438
std        12.887003    13.006024   30289.038695
min         1.000000     0.000000   57800.000000
25%        12.000000     7.000000   91000.000000
50%        21.000000    16.000000  107300.000000
75%        32.000000    27.000000  134185.000000
max        56.000000    60.000000  231545.000000

In [10]:
salaries["yrs.since.phd"].mean()

22.31486146095718

In [11]:
salaries["yrs.service"].mean()

17.614609571788414

In [12]:
salaries["salary"].mean()

113706.45843828715

In [13]:
salaries["salary"].std()

30289.038694747804

In [14]:
import sympy as sym
from sympy.abc import i, j, k, m, n, x

In [15]:
xi, xm =sym.symbols("x_i x_m")
xi

x_i

In [16]:
xm

x_m

### Sample mean

In [19]:
sym.Sum(xi, (i, 1, n))/n

Sum(x_i, (i, 1, n))/n

In [21]:
def sample_mean(data):
    sample_sum = data.sum()
    count = data.count()
    mean = sample_sum / count
    return mean

In [22]:
sample_mean(salaries["yrs.since.phd"])

22.31486146095718